; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p11---int100n150-m25---int100c110---s175---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level4 level4)
(sum level0 level5 level5)
(sum level0 level15 level15)
(sum level0 level21 level21)
(sum level0 level25 level25)
(sum level1 level1 level2)
(sum level1 level4 level5)
(sum level1 level5 level6)
(sum level1 level15 level16)
(sum level1 level21 level22)
(sum level2 level1 level3)
(sum level2 level4 level6)
(sum level2 level5 level7)
(sum level2 level15 level17)
(sum level2 level21 level23)
(sum level3 level1 level4)
(sum level3 level4 level7)
(sum level3 level5 level8)
(sum level3 level15 level18)
(sum level3 level21 level24)
(sum level4 level1 level5)
(sum level4 level4 level8)
(sum level4 level5 level9)
(sum level4 level15 level19)
(sum level4 level21 level25)
(sum level5 level1 level6)
(sum level5 level4 level9)
(sum level5 level5 level10)
(sum level5 level15 level20)
(sum level6 level1 level7)
(sum level6 level4 level10)
(sum level6 level5 level11)
(sum level6 level15 level21)
(sum level7 level1 level8)
(sum level7 level4 level11)
(sum level7 level5 level12)
(sum level7 level15 level22)
(sum level8 level1 level9)
(sum level8 level4 level12)
(sum level8 level5 level13)
(sum level8 level15 level23)
(sum level9 level1 level10)
(sum level9 level4 level13)
(sum level9 level5 level14)
(sum level9 level15 level24)
(sum level10 level1 level11)
(sum level10 level4 level14)
(sum level10 level5 level15)
(sum level10 level15 level25)
(sum level11 level1 level12)
(sum level11 level4 level15)
(sum level11 level5 level16)
(sum level12 level1 level13)
(sum level12 level4 level16)
(sum level12 level5 level17)
(sum level13 level1 level14)
(sum level13 level4 level17)
(sum level13 level5 level18)
(sum level14 level1 level15)
(sum level14 level4 level18)
(sum level14 level5 level19)
(sum level15 level1 level16)
(sum level15 level4 level19)
(sum level15 level5 level20)
(sum level16 level1 level17)
(sum level16 level4 level20)
(sum level16 level5 level21)
(sum level17 level1 level18)
(sum level17 level4 level21)
(sum level17 level5 level22)
(sum level18 level1 level19)
(sum level18 level4 level22)
(sum level18 level5 level23)
(sum level19 level1 level20)
(sum level19 level4 level23)
(sum level19 level5 level24)
(sum level20 level1 level21)
(sum level20 level4 level24)
(sum level20 level5 level25)
(sum level21 level1 level22)
(sum level21 level4 level25)
(sum level22 level1 level23)
(sum level23 level1 level24)
(sum level24 level1 level25)

(connected l0 l1)
(fuelcost level25 l0 l1)
(connected l0 l2)
(fuelcost level21 l0 l2)
(connected l0 l3)
(fuelcost level1 l0 l3)
(connected l1 l0)
(fuelcost level25 l1 l0)
(connected l1 l2)
(fuelcost level5 l1 l2)
(connected l1 l3)
(fuelcost level4 l1 l3)
(connected l2 l0)
(fuelcost level21 l2 l0)
(connected l2 l1)
(fuelcost level5 l2 l1)
(connected l2 l3)
(fuelcost level15 l2 l3)
(connected l3 l0)
(fuelcost level1 l3 l0)
(connected l3 l1)
(fuelcost level4 l3 l1)
(connected l3 l2)
(fuelcost level15 l3 l2)

(at t0 l0)
(fuel t0 level20)
(= (total-cost) 0)

(at p0 l2)
(at p1 l1)
(at p2 l2)
(at p3 l1)
(at p4 l2)
(at p5 l1)
(at p6 l1)
(at p7 l0)
(at p8 l0)
(at p9 l3)
(at p10 l0)
)

(:goal
(and
(at p0 l1)
(at p1 l3)
(at p2 l3)
(at p3 l3)
(at p4 l3)
(at p5 l3)
(at p6 l3)
(at p7 l3)
(at p8 l2)
(at p9 l1)
(at p10 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p8 t0 l0)
   deleted: (at p8 l0)
   added: (in p8 t0)
   goals met: 0 of 11
2. (load p7 t0 l0)
   deleted: (at p7 l0)
   added: (in p7 t0)
   goals met: 0 of 11
3. (load p10 t0 l0)
   deleted: (at p10 l0)
   added: (in p10 t0)
   goals met: 0 of 11
4. (drive t0 l0 l3 level19 level1 level20)
   deleted: (at t0 l0) (fuel t0 level20)
   added: (at t0 l3) (fuel t0 level19)
   goals met: 0 of 11
5. (unload p7 t0 l3)
   deleted: (in p7 t0)
   added: (at p7 l3)
   goals met: 1 of 11
6. (unload p10 t0 l3)
   deleted: (in p10 t0)
   added: (at p10 l3)
   goals met: 2 of 11
7. (load p9 t0 l3)
   deleted: (at p9 l3)
   added: (in p9 t0)
   goals met: 2 of 11
8. (drive t0 l3 l1 level15 level4 level19)
   deleted: (at t0 l3) (fuel t0 level19)
   added: (at t0 l1) (fuel t0 level15)
   goals met: 2 of 11
9. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 2 of 11
10. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 2 of 11
11. (drive t0 l1 l2 level10 level5 level15)
   deleted: (at t0 l1) (fuel t0 level15)
   added: (at t0 l2) (fuel t0 level10)
   goals met: 2 of 11
12. (unload p8 t0 l2)
   deleted: (in p8 t0)
   added: (at p8 l2)
   goals met: 3 of 11
13. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 3 of 11
14. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 3 of 11
15. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 3 of 11
16. (drive t0 l2 l1 level5 level5 level10)
   deleted: (at t0 l2) (fuel t0 level10)
   added: (at t0 l1) (fuel t0 level5)
   goals met: 3 of 11
17. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 3 of 11
18. (load p6 t0 l1)
   deleted: (at p6 l1)
   added: (in p6 t0)
   goals met: 3 of 11
19. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 4 of 11
20. (unload p9 t0 l1)
   deleted: (in p9 t0)
   added: (at p9 l1)
   goals met: 5 of 11
21. (drive t0 l1 l3 level1 level4 level5)
   deleted: (at t0 l1) (fuel t0 level5)
   added: (at t0 l3) (fuel t0 level1)
   goals met: 5 of 11
22. (unload p1 t0 l3)
   deleted: (in p1 t0)
   added: (at p1 l3)
   goals met: 6 of 11
23. (unload p2 t0 l3)
   deleted: (in p2 t0)
   added: (at p2 l3)
   goals met: 7 of 11
24. (unload p3 t0 l3)
   deleted: (in p3 t0)
   added: (at p3 l3)
   goals met: 8 of 11
25. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 9 of 11
26. (unload p5 t0 l3)
   deleted: (in p5 t0)
   added: (at p5 l3)
   goals met: 10 of 11
27. (unload p6 t0 l3)
   deleted: (in p6 t0)
   added: (at p6 l3)
   goals met: 11 of 11
